# 1. 初识C++

## 1.1 C++常量

```c++
#include<iostream>
using namespace std;

// 文件开头，通过#define 常量名 常量值，定义常量
#define Day 7

int main() {
	cout << "一周有" << Day << "天" << endl;

	// const 常量类型 常量名 常量值
	const int month = 12;
	cout << "There is " << month << " months in one year." << endl;

	system("pause");
	return 0;
}
```

## 1.2 #define宏定义

C++中，多次define选择最后一次

```C++
// define01.h
#include <iostream>;

using namespace std;

#define MAX 10
#define MAX 20
#define MAX 30
```

```C++
// define01.cpp
#include "define01.h"

#define MAX 40

// 最近的一次是40,故打印40

int main() {
	cout << "MAX = " << MAX << endl;
	system("pause");
	return 0;
}
```

如果调整下顺序：

```C++
// define01.cpp
#define MAX 40
#include "define01.h"

// 最近的一次是30,故打印30

int main() {
	cout << "MAX = " << MAX << endl;
	system("pause");
	return 0;
}
```

重复定义，会有如下编译告警：

------

*1>D:\git\C_plus_demo\1. C++基础编程\define01.h(7,1): warning C4005: “MAX”: 宏重定义
1>D:\git\C_plus_demo\1. C++基础编程\define01.h(6): message : 参见“MAX”的前一个定义*

------

重定义给编译器制造了额外的工作，开发中要尽可能避免。

## 1.3 避免重复包含

有些头文件不可避免的会在多个文件中include，在程序预处理阶段，如果多次include同一个头文件，会增加预处理器的检查负担。

为避免上述问题，有两种方式：

### 1.3.1 使用#pragma once

在头文件开头添加#pragma once，编译器会保证同一个头文件只include一次

但这种写法不兼容一些老版本

```c++
// define02.h
#pragma once
#define MIN = 0;
```

### 1.3.2 使用#ifndef

兼容性更好的写法，但是缺点是每次都得想一个宏的名字作为开关

```C++
#ifndef SWITCH
#define SWITCH "on"
	// 执行要执行的声明、定义语句
#endif
```

# 2. 数据类型

## 2.1 sizeof关键字

**作用**：利用sizeof关键字可以统计数据类型所占内存的大小，单位：字节

**语法**：sizeof(数据类型/变量)

```c++

// 赋值运算符重载
class Person
{
public:
	Person(int age)
	{
		this->age = new int(age);
	}

	~Person()
	{
		if (age != NULL)
		{
			delete age;
			age = NULL;
		}
	}

	int* age;
};

int main() {
	Person p1(10);
	Person p2(20);

	// 赋值操作，执行时报异常
	p2 = p1;

	system("pause");
	return 0;
}
```

通过赋值运算符重载，引入深拷贝解决本问题：

```C++
#include <iostream>

using namespace std;

// 赋值运算符重载：解决浅拷贝问题
class Person
{
public:
	Person(int age)
	{
		this->age = new int(age);
	}

	~Person()
	{
		if (age != NULL)
		{
			delete age;
			age = NULL;
		}
	}

	// 赋值运算符重载01：使用成员函数
	Person& operator=(Person& p)
	{
		// 深拷贝
		age = new int(*p.age);
		return *this;
	}

	int* age;
};

// 赋值运算符重载必须为成员函数，不能是全局函数
// 如下代码报错
//Person& operator=(Person& p1, Person& p2)
//{
//}

int main() {
	Person p1(10);
	Person p2(20);

	// 赋值操作，执行时报异常
	p2 = p1;

	system("pause");
	return 0;
}
```

## 13.5 关系运算符重载

```C++
#include <iostream>

using namespace std;

// 关系运算符重载
class Person
{
public:
	Person(int age)
	{
		this->age = age;
	}

	bool operator==(const Person& p)
	{
		return age == p.age;
	}

	int age;
};

int main() {
	Person p1(10);
	Person p2(20);
	bool flag = p1 == p2;
	if (p1 == p2)
	{
		cout << "p1 == p2" << endl;
	}
	else
	{
		cout << "p1 != p2" << endl;
	}

	system("pause");
	return 0;
}
```

## 13.6 函数调用运算符重载

- 函数调用运算符 () 也可以重载
- 由于重载后使用的方式非常像函数的调用，因此称为**仿函数**
- 仿函数没有固定写法，非常灵活

```C++
#include <iostream>

using namespace std;

// 函数调用运算符重载
class Person
{
public:
	void operator()(string text)
	{
		cout << text << endl;
	}
};

int main() {
	Person p;
	p("Hello World");

	// 直接通过匿名对象调用也是可以的
	Person()("Hello World");

	system("pause");
	return 0;
}
```

# 14. 继承

## 14.1 继承的基本语法

```C++
#include <iostream>

using namespace std;

class Father
{
public:
	void speak()
	{
		cout << "hello" << endl;
	}
};

// 继承的基本语法：class 子类类名 : 继承方式 父类类名
class Son : public Father
{
public:
	void study()
	{
		cout << "I'm studying" << endl;
	}
};

int main() {
	Son son;
	son.speak();
	son.study();

	system("pause");
	return 0;
}
```

## 14.2 继承方式

| 继承方式\父类成员权限 | public    | protected | private  |
| --------------------- | --------- | --------- | -------- |
| public                | public    | protected | 无法继承 |
| protected             | protected | protected | 无法继承 |
| private               | private   | private   | 无法继承 |

## 14.3 继承的对象模型

如下代码的类Son，占用多少字节？

```C++
#include <iostream>

using namespace std;

class Father
{
public:
	int a;
protected:
	int b;
private:
	int c;
};

class Son : public Father
{
private:
	int d;
};

int main() {
	// 打印结果：16
	cout << "sizeof(son)" << sizeof(Son) << endl;

	system("pause");
	return 0;
}
```

说明父类private的成员也会被子类继承下来。

如何查看对象模型？

1. 开始菜单，找到"Developer PowerShell for VS 2019"并打开
2. 定位到当前cpp对应位置
3. 输入如下命令

```
cl /d1 reportSingleClassLayout类名 所属的文件名
```

结果如下，证明了刚才的观点

```
PS D:\git\C_plus_demo\2. C++核心编程> cl /d1 reportSingleClassLayoutSon '.\48. 继承中的对象模型.cpp'
用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.29.30037 版
版权所有(C) Microsoft Corporation。保留所有权利。

48. 继承中的对象模型.cpp

class Son       size(16):
        +---
 0      | +--- (base class Father)
 0      | | a
 4      | | b
 8      | | c
        | +---
12      | d
        +---
```

## 14.4 继承中构造与析构的顺序

父类先构造，子类先析构

```C++
#include <iostream>

using namespace std;

class Father
{
public:
	Father()
	{
		cout << "父类构造函数" << endl;
	}

	~Father()
	{
		cout << "父类析构函数" << endl;
	}
};

class Son : public Father
{
public:
	Son()
	{
		cout << "子类构造函数" << endl;
	}

	~Son()
	{
		cout << "子类析构函数" << endl;
	}
};

void test01()
{
	Son son;
}

int main() {
	test01();

	system("pause");
	return 0;
}
```

```
父类构造函数
子类构造函数
子类析构函数
父类析构函数
```

## 14.5 继承中同名成员的访问

子类中的同名成员，直接访问即可

父类中的同名成员，通过父类类名::访问

```C++
#include <iostream>

using namespace std;

class Father
{
public:
	Father()
	{
		age = 30;
	}
	void speak()
	{
		cout << "I'm father" << endl;
	}

	int age;
};

class Son : public Father
{
public:
	Son()
	{
		age = 10;
	}
	void speak()
	{
		cout << "I'm son" << endl;
	}
	int age;
};

void test01()
{
	Son son;

	son.age;
	// 父类成员变量，通过类名::访问
	son.Father::age;

	son.speak();
	// 父类成员函数，通过类名::访问
	son.Father::speak();
}

int main() {
	test01();

	system("pause");
	return 0;
}
```

## 14.6 继承同名静态成员的访问

分为通过对象访问和通过类名访问两种方式：

```C++
#include <iostream>

using namespace std;

class Father
{
public:
	static void speak()
	{
		cout << "I'm father" << endl;
	}

	static int age;
};

class Son : public Father
{
public:
	static void speak()
	{
		cout << "I'm son" << endl;
	}
	static int age;
};

int Father::age = 30;
int Son::age = 10;

void test01()
{
	Son son;

	son.age;
	// 访问父类静态成员变量
	// 通过对象访问
	son.Father::age;
	// 通过类名访问
	Son::Father::age;

	son.speak();
	// 访问父类静态成员函数
	// 通过对象访问
	son.Father::speak();
	// 通过类名访问
	Son::Father::speak();
}

int main() {
	test01();

	system("pause");
	return 0;
}
```

## 14.7 多继承

C++可以多继承，实际开发中不推荐使用。

```C++
#include <iostream>

using namespace std;

class Father1
{
public:
	int a;
	int b;
};

class Father2
{
public:
	int a;
	int c;
};

// 多继承语法
class Son : public Father1, public Father2
{
};

void test()
{
	Son son;

	// 多继承时，多个父类如果有重名成员，需要通过作用域指明
	// son.a;

	son.Father1::a;
	son.Father2::a;
}

int main() {
	test();

	system("pause");
	return 0;
}
```

## 14.8 菱形继承

菱形继承的问题：

```C++
#include <iostream>

using namespace std;

class Father
{
public:
    int a;
};

class Son1 : public Father
{
};

class Son2 : public Father
{
};

class GrandSon : public Son1, public Son2
{
};

void test()
{
	GrandSon gs;
	// 菱形继承，子类继承了两份数据，如下代码报错
	//gs.a = 10;

	// 必须显示地指明是哪个父类的数据，但实际上不需要两份
	gs.Son1::a = 10;
	gs.Son2::a = 20;
}

int main() {
	test();

	system("pause");
	return 0;
}
```

打印GrandSon的结构：

```C++
PS D:\git\C_plus_demo\2. C++核心编程> cl /d1 reportSingleClassLayoutGrandSon '.\53. 菱形继承01.cpp'
用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.29.30037 版
版权所有(C) Microsoft Corporation。保留所有权利。

53. 菱形继承01.cpp

class GrandSon  size(8):
        +---
 0      | +--- (base class Son1)
 0      | | +--- (base class Father)
 0      | | | a
        | | +---
        | +---
 4      | +--- (base class Son2)
 4      | | +--- (base class Father)
 4      | | | a
        | | +---
        | +---
        +---
```

可通过虚继承解决菱形继承的问题

```C++
#include <iostream>

using namespace std;

class Father
{
public:
	int a;
};

class Son1 : virtual public Father
{
};

class Son2 : virtual public Father
{
};

class GrandSon : public Son1, public Son2
{
};

void test()
{
	GrandSon gs;
	// 采用虚继承后，不存在不明确的问题
	gs.a = 10;
}

int main() {
	test();

	system("pause");
	return 0;
}
```

打印GrandSon，Son1中保存4字节的vbptr（virtual base pointer虚基类指针），指向下面Son1的虚基类表（vbtable），vbtable有8个字节的偏移量，正好指向GrandSon中的a。Son2同理。

```
PS D:\git\C_plus_demo\2. C++核心编程> cl /d1 reportSingleClassLayoutGrandSon '.\54. 菱形继承02.cpp'
用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.29.30037 版
版权所有(C) Microsoft Corporation。保留所有权利。

54. 菱形继承02.cpp

class GrandSon  size(12):
        +---
 0      | +--- (base class Son1)
 0      | | {vbptr}
        | +---
 4      | +--- (base class Son2)
 4      | | {vbptr}
        | +---
        +---
        +--- (virtual base Father)
 8      | a
        +---

GrandSon::$vbtable@Son1@:
 0      | 0
 1      | 8 (GrandSond(Son1+0)Father)

GrandSon::$vbtable@Son2@:
 0      | 0
 1      | 4 (GrandSond(Son2+0)Father)
vbi:       class  offset o.vbptr  o.vbte fVtorDisp
          Father       8       0       4 0
```

## 14.9 子类调用父类构造函数

子类可以继承父类所有的成员变量和成员方法，但不继承父类的构造方法）。因此，在创建子类对象时，为了初始化从父类继承来的数据成员，系统需要调用其父类的构造方法。

1. 如果子类没有定义构造函数，则调用父类的默认构造方法。
2. 在创建子类对象时候，如果子类的构造函数没有显示调用父类的构造函数，则会调用父类的默认构造函数。
3. 在创建子类对象时候，如果子类的构造函数没有显示调用父类的构造函数 且父类只定义了自己的有参构造函数，则会出错（如果父类只有有参数的构造方法，则子类必须显示调用此带参构造方法）。
4. 如果子类调用父类带参数的构造方法，需要用初始化列表的方式。

```C++
#include <iostream>
using namespace std;

class Father
{
public:
	Father()
	{
		cout << "Father 无参构造函数" << endl;
	}

	Father(string name)
	{
		cout << "Father 有参构造函数" << endl;
		this->name = name;
	}

	string name;
};

class Son : public Father
{
public:
	// 调用父类构造函数
	Son() : Father(), age(10)
	{
		cout << "Son 无参构造函数" << endl;
	}

	// 调用父类有参构造函数
	Son(string name) : Father(name), age(10)
	{
		cout << "Son 有参构造函数" << endl;
	}
	int age;
};

void test()
{
	Son son;
	Son son2("Tom");
}

int main()
{
	test();

	system("pause");
}
```

```
Father 无参构造函数
Son 无参构造函数
Father 有参构造函数
Son 有参构造函数
```



# 15. 多态

C++通过派生类与虚函数实现多态，对象运行时绑定

多态出现的几个条件：

1. 有继承关系
2. 子类重写父类的虚函数
3. 父类指针或父类引用接受子类对象

## 15.1 多态举例

```C++
#include <iostream>

using namespace std;

class Animal
{
public:
	virtual void speak()
	{
		cout << "动物叫" << endl;
	}
};

class Dog : public Animal
{
public:
	void speak()
	{
		cout << "汪汪汪" << endl;
	}
};

// 多态条件：父类引用接收子类对象
void test(Animal& animal)
{
	animal.speak();
}

// 多态条件：父类指针接收子类对象
void test(Animal* animal)
{
	animal->speak();
}

int main() {
	Dog dog;
	test(dog);
	test(&dog);

	system("pause");
	return 0;
}
```

```
汪汪汪
汪汪汪
```

打印下Dog的对象结构，可以看到父类中保存的是一个指向vftable（虚函数表）的指针（vfptr），该表中保存了实际要执行的函数。例如如果子类重写了，就是Dog::speak()，否则是Animal::speak()

```
PS D:\git\C_plus_demo\2. C++核心编程> cl /d1 reportSingleClassLayoutDog '.\55. 多态举例.cpp'
用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.29.30037 版
版权所有(C) Microsoft Corporation。保留所有权利。

55. 多态举例.cpp

class Dog       size(4):
        +---
 0      | +--- (base class Animal)
 0      | | {vfptr}
        | +---
        +---

Dog::$vftable@:
        | &Dog_meta
        |  0
 0      | &Dog::speak
```



## 15.2 纯虚函数和抽象类

在多态中，通常父类中虚函数的实现是毫无意义的，主要都是调用子类重写的内容

因此可以将虚函数改为**纯虚函数**

纯虚函数语法：`virtual 返回值类型 函数名 （参数列表）= 0 ;`

当类中有了纯虚函数，这个类也称为抽象类

**抽象类特点**：

- 无法实例化对象
- 子类必须重写抽象类中的纯虚函数，否则也属于抽象类

```C++
#include <iostream>

using namespace std;

class Animal
{
public:
	// 纯虚函数语法，有纯虚函数的类是抽象类，无法实例化对象
	virtual void speak() = 0;
};

class Dog : public Animal
{
public:
	// 父类中存在纯虚函数，子类需重写，否则子类也是抽象类
	void speak()
	{
		cout << "汪汪汪" << endl;
	}
};

int main() {
	// Animal是抽象类，无法实例化对象，如下代码报错
	//Animal animal;

	system("pause");
	return 0;
}
```

## 15.3 虚析构和纯虚析构

什么时候需要虚析构/纯虚析构？

同时满足：

1. 对象是创在在堆区的（new），需要释放
2. 对象涉及多态

上面两条满足时，只会调用父类的析构函数，不会调用子类的，例如：

```C++
#include <iostream>

using namespace std;

class Animal
{
public:
	Animal()
	{
		cout << "父类构造函数" << endl;
	}

	~Animal()
	{
		cout << "父类析构函数" << endl;
	}

